Repository: imath/autoblue
Catalog: autoblue-*.po
Languages: fr_fr

source: Automatically share new posts to Bluesky.
fr_fr: Partagez automatiquement vos nouveaux articles sur Bluesky.

source: Comments
fr_fr: Conversation

source: Join the conversation on Bluesky
fr_fr: Rejoignez la conversation depuis Bluesky

source: Settings
fr_fr: Réglages

source: List of connected Bluesky accounts.
fr_fr: Liste des comptes Bluesky connectés.

source: True is sharing is enabled by default for new posts.
fr_fr: Vrai active par défaut le partage des nouveaux articles.

source: The log level for Autoblue.
fr_fr: Le niveau de journalisation pour Autoblue.

source: The current database version.
fr_fr: La version en base de données actuelle.

source: Skipping image: Failed to find image with ID `{attachment_id}`.
fr_fr: Image ignorée : Autoblue n’est pas parvenu à trouver une image ayant pour ID `{attachment_id}`.

source: Skipping image: Invalid mime type for image with ID `{attachment_id}`. Allowed types are `{allowed_types}`, but got `{mime_type}`.
fr_fr: Image ignorée : Le type mime de l’image ayant pour ID `{attachment_id}` n’est pas valide. Les types pris en charge sont `{allowed_types}`, ce qui ne comprend pas `{mime_type}`.

source: Skipping image: Compression failed for image with ID `{attachment_id}`.
fr_fr: Image ignorée : Autoblue n’est pas parvenu à compresser l’image ayant pour ID `{attachment_id}`.

source: Skipping image: Failed to upload image with ID `{attachment_id}` to Bluesky:
fr_fr: Image ignorée : Autoblue n’est pas parvenu à transférer l’image ayant pour ID `{attachment_id}` à Bluesky :

source: Uploaded image with ID `{attachment_id}` to Bluesky.
fr_fr: Autoblue a transféré l’image ayant pour ID `{attachment_id}` à Bluesky.

source: Share failed: Post with ID {post_id} not found.
fr_fr: Le partage a échoué : Autoblue n’est pas parvenu à trouver l’article ayant pour ID `{post_id}`.

source: Share failed: No Bluesky connection found.
fr_fr: Le partage a échoué : Autoblue n’est pas parvenu à trouver de connexion Bluesky.

source: Failed to refresh Bluesky connection tokens before sharing:
fr_fr: Autoblue n’est pas parvenu à rafraîchir les jetons de connexion de Bluesky avant sa tentative de partage :

source: Failed to share post with ID {post_id} to Bluesky:
fr_fr: Autoblue n’est pas parvenu à partager l’article ayant pour ID `{post_id}` avec Bluesky :

source: Shared post {post_title} with ID {post_id} to Bluesky: {bluesky_url}
fr_fr: L’article ayant pour titre {post_title} et ID {post_id} a été partagé avec Bluesky : {bluesky_url}

source: Invalid DID or password.
fr_fr: L’identifiant décentralisé (DID) ou le mot de passe sont non valides.

source: Invalid refresh JWT.
fr_fr: Le jeton d’authentification JSON (JWT) rafraîchi est non valide.

source: Invalid record or access token.
fr_fr: L’enregistrement ou le jeton d’accès sont non valides.

source: Invalid blob or MIME type.
fr_fr: L’objet binaire large (blob) ou le type mime sont non valides.

source: Invalid access token.
fr_fr: Le jeton d’accès est non valide.

source: Error uploading blob.
fr_fr: Une erreur est survenue lors du transfert de l’objet binaire large (blob).

source: Unknown error.
fr_fr: Erreur inconnue.

source: No message
fr_fr: Aucun message

source: Connection not added: Connection with DID `{did}` already exists.
fr_fr: La connexion n’a pas été ajoutée : la connexion ayant pour identifiant décentralisé (DID) `{did}` existe déjà.

source: Connection already exists.
fr_fr: La connexion existe déjà.

source: Connection not added: Invalid DID: `{did}`
fr_fr: La connexion n’a pas été ajoutée : l’identifiant décentralisé (DID) `{did}` n’est pas valide

source: Invalid DID.
fr_fr: L’identifiant décentralisé (DID) n’est pas valide.

source: Connection not added: Invalid app password.
fr_fr: La connexion n’a pas été ajoutée : le mot de passe de l’application est non valide.

source: Invalid app password.
fr_fr: Le mot de passe de l’application est non valide.

source: Connection not added: Failed to authenticate with Bluesky.
fr_fr: La connexion n’a pas été ajoutée : Autoblue n’est pas parvenu à vous authentifier sur Bluesky.

source: Connection with handle `{handle}` added.
fr_fr: La connexion pour le pseudo `{handle}` a été ajoutée.

source: Connection added.
fr_fr: La connexion a été ajoutée.

source: Connection not deleted: Invalid DID: `{did}`
fr_fr: La connexion n’a pas été supprimée : l’identifiant décentralisé (DID) `{did}` n’est pas valide

source: Connection not deleted: Connection not found.
fr_fr: La connexion n’a pas été supprimée : elle est introuvable.

source: Connection not found.
fr_fr: La connexion est introuvable.

source: Connection with DID `{did}` deleted.
fr_fr: La connexion ayant pour identifiant décentralisé (DID) `{did}` a été supprimée.

source: DID of the account to fetch.
fr_fr: Identifiant décentralisé (DID) du compte à récupérer.

source: DID of the connection to be deleted.
fr_fr: Identifiant décentralisé (DID) de la connexion à supprimer.

source: DID of the Bluesky account.
fr_fr: Identifiant décentralisé (DID) du compte Bluesky.

source: An app password linked to the Bluesky account to be added.
fr_fr: Un mot de passe d’application lié au compte Bluesky à ajouter.

source: Search query prefix
fr_fr: Préfixe de la requête de recherche

source: [Success]
fr_fr: [Succès]

source: Whether the post should be shared to Bluesky.
fr_fr: Partage ou pas l’article sur Bluesky.

source: An optional custom message to include with the post.
fr_fr: Un message personnalisé optionnel à intégrer au-dessus du lien vers l’article.

source: A list of shares of the post.
fr_fr: La liste des partages effectués de l’article.

source: A Bluesky post URL to show likes and replies from.
fr_fr: Une URL de publication sur Bluesky utilisée pour montrer les « likes » et les réponses rattachées.

source: Skipping share for post `{post_title}` with ID `{post_id}` because it is not enabled.
fr_fr: Le partage de l’article ayant pour titre `{post_title}` et ID `{post_id}` a été ignoré car il n’est pas autorisé.

source: Skipping share for post `{post_title}` with ID `{post_id}` because it is not a supported post type. Valid post types are: `{valid_post_types}`, but got `{post_type}`.
fr_fr: Le partage de l’article ayant pour titre `{post_title}` et ID `{post_id}` a été ignoré car son type de publication n’est pas pris en charge. Les types de publications pris en charge sont `{valid_post_types}`, ce qui ne comprend pas `{post_type}`.

source: Skipping share for post `{post_title}` with ID `{post_id}` because the post is already published.
fr_fr: Le partage de l’article ayant pour titre `{post_title}` et ID `{post_id}` a été ignoré car son statut est déjà « publié ».

source: Skipping share for post `{post_title}` with ID `{post_id}` because a share is already scheduled.
fr_fr: Le partage de l’article ayant pour titre `{post_title}` et ID `{post_id}` a été ignoré car un partage a déjà été planifié.

source: Processing share for post `{post_title}` with ID `{post_id}` immediately.
fr_fr: Traitement immédiat du partage de l’article ayant pour titre `{post_title}` et ID `{post_id}`.

source: Scheduling share for post `{post_title}` with ID `{post_id}`.
fr_fr: Planification du partage de l’article ayant pour titre `{post_title}` et ID `{post_id}`.

source: Processing share for post `{post_title}` with ID `{post_id}`.
fr_fr: Traitement du partage de l’article ayant pour titre `{post_title}` et ID `{post_id}`.

source: Delete
fr_fr: Supprimer

source: No accounts found. Please try another search.
fr_fr: Aucun compte trouvé. Merci d’essayer une autre recherche.

source: Search for a Bluesky account
fr_fr: Rechercher un compte Bluesky

source: Bluesky Account
fr_fr: Compte Bluesky

source: Account "%s" connected
fr_fr: Le compte « %s » est connecté

source: Failed to connect account
fr_fr: La connexion au compte a échoué

source: Account disconnected
fr_fr: Le compte est déconnecté

source: Failed to disconnect account
fr_fr: La déconnexion au compte a échoué

source: Logs refreshed.
fr_fr: Les journaux ont été rafraîchis.

source: Failed to refresh logs.
fr_fr: Le rafraîchissement des journaux a échoué.

source: Logs cleared.
fr_fr: Les journaux ont été effacés.

source: Failed to clear logs.
fr_fr: L’effacement des journaux a échoué.

source: Connect Bluesky account
fr_fr: Connecter le compte Bluesky

source: App Password
fr_fr: Mot de passe d’application

source: You can create a new app password in your <a>Bluesky account settings</a>.
fr_fr: Vous pouvez créer un nouveau mot de passe d’application dans les <a>réglages de votre compte Bluesky</a>.

source: Connect Account
fr_fr: Connecter le compte

source: Something went wrong. Make sure the app password is correct.
fr_fr: Quelque chose s’est mal passé. Merci de vous assurer que le mot de passe d’application est correct.

source: Please enter an app password.
fr_fr: Merci de saisir un mot de passe d’application.

source: Please pick an account to add.
fr_fr: Merci de sélectionner le compte à ajouter.

source: No account connected.
fr_fr: Aucun compte connecté.

source: Connect a Bluesky account
fr_fr: Connecter un compte Bluesky

source: Disconnect
fr_fr: Déconnecter

source: Are you sure you want to disconnect this account?
fr_fr: Êtes-vous certain·e de vouloir déconnecter ce compte ?

source: Automatic sharing to Bluesky enabled.
fr_fr: Partage automatique sur Bluesky activé.

source: Automatic sharing to Bluesky disabled.
fr_fr: Partage automatique sur Bluesky désactivé.

source: Bluesky account
fr_fr: Compte Bluesky

source: Automatically share posts to Bluesky
fr_fr: Partagez automatiquement vos articles sur Bluesky

source: When enabled, new posts will be automatically shared to Bluesky. You can change this on a per-post basis.
fr_fr: Lorsqu’activé, les nouveaux articles seront automatiquement partagés sur Bluesky. Vous pouvez modifier ceci pour chaque article.

source: Autoblue is created by <a>Daniel Post</a>. Not officially affiliated with or endorsed by Bluesky.
fr_fr: Autoblue est crée par <a>Daniel Post</a>. Cette extension n’est pas affiliée officiellement ou approuvé par Bluesky.

source: Debug
fr_fr: Déboguer

source: Everything will be logged. Useful for debugging.
fr_fr: Tout sera journalisé : utile pour le débogage.

source: Errors, warnings and info messages will be logged.
fr_fr: Les erreurs, alertes et messages d’information seront journalisés.

source: Error
fr_fr: Erreur

source: Only critical errors will be logged.
fr_fr: Seules les erreurs critiques seront journalisées.

source: Off
fr_fr: Éteint

source: Nothing will be logged.
fr_fr: Rien ne sera journalisé.

source: Log level updated to "%s".
fr_fr: Niveau de journalisation mis à jour pour « %s ».

source: Context
fr_fr: Contexte

source: Level
fr_fr: Niveau

source: Log level
fr_fr: Niveau de journalisation

source: Choose the level of logs to save. This will not affect existing logs.
fr_fr: Choisissez le niveau de journalisation à enregistrer. Cela n’affectera pas les journaux existants.

source: Clear logs
fr_fr: Effacer les journaux

source: Are you sure you want to clear all logs?
fr_fr: Êtes vous certain·e de vouloir effacer tous les journaux ?

source: View options
fr_fr: Afficher les options

source: (recommended)
fr_fr: (Recommandé)

source: Refresh logs
fr_fr: Rafraîchir les journaux

source: Previous page
fr_fr: Page précédente

source: Next page
fr_fr: Page suivante

source: Showing %1$d-%2$d of %3$d logs
fr_fr: Affichage de %1$d-%2$d sur %3$d journaux

source: View Context
fr_fr: Afficher le contexte

source: Time
fr_fr: Heure

source: No logs (yet).
fr_fr: Aucun journal (jusqu’à présent).

source: Logs
fr_fr: Journaux

source: Shared to Bluesky
fr_fr: Partagé sur Bluesky

source: View on Bluesky
fr_fr: Afficher sur Bluesky

source: Sharing was disabled for this post.
fr_fr: Le partage a été désactivé pour cet article.

source: Bluesky Post URL
fr_fr: URL de la publication sur Bluesky

source: If you used Autoblue to share this post, replies from that URL will show up automatically. If you did not use Autoblue or want to show replies from a different URL, you can enter it here.
fr_fr: Si vous avez utilisé Autoblue pour partagé cet article, les réponses ajoutées depuis Bluesky seront automatiquement affichées.

source: Share to Bluesky
fr_fr: Partager sur Bluesky

source: Add an optional message to the Bluesky post.
fr_fr: Ajouter un message optionnel au-dessus de votre publication sur Bluesky.

source: Sharing to:
fr_fr: Partage sur :

# block title
source: Autoblue Comments
fr_fr: Commentaires Autoblue

# block description
source: Display Bluesky comments on your site.
fr_fr: Affiche les commentaires Bluesky sur votre site.
